Repository: WheelaStudio/RandomNumberGenerator_macOS
Catalog: RandomNumberGenerator/Localization/*.lproj/Localizable.strings
Languages: de

source: From:
de: Von:

source: To:
de: An:

source: Generate
de: Generieren

source: History
de: Geschichte

source: Result:
de: Ergebnis:

# NUM_GREATER_THAN_ANTOHER
source: The number 'from' cannot be more than the number 'to'!
de: Die Zahl „von“ darf nicht größer sein als die Zahl „bis“!

# INCORRECT_INPUT
source: Number diapason is incorrect or missing!
de: Der Nummernkreis ist ungültig oder fehlt!

# COPY
source: Copy result
de: Ergebnis kopieren

source: With step:
de: Mit Schritt:

# STEP_ERROR
source: Step is incorrect!
de: Schritt falsch eingegeben!

source: Delete
de: Löschen

# HISTORY_IS_EMPTY
source: The history of generations is still empty!
de: Generationsverlauf ist noch leer!

# DELETE_SELECTED
source: Delete selected item/items?
de: Möchten Sie die ausgewählten Elemente löschen?

# DELETE_ALL
source: Delete all items?
de: Möchten Sie alle Elemente löschen?

source: Yes
de: Ja

# HISTORY_DESCRIPTION
source: (from, to, step) = result
de: (von, bis, Schritt) = Ergebnis

# APPLY_TO_INTERFACE
source: Apply calculation data to interface
de: Berechnungsdaten auf Schnittstelle anwenden
